fe40/tutorials/rheoFoam/Aneurysm/HerschelBulkley/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type            HerschelBulkley;
                
                rho             rho   [1 -3 0 0 0 0 0] 1050;
                eta0            eta0   [ 1 -1 -1 0 0 0 0 ] 0.15; 
   		tau0            tau0  [ 1 -1 -2 0 0 0 0 ] .0175; 
   		k               k     [ 1 -1 -1 0 0 0 0 ] 8.9721e-3; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.8601; 
               
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
