fe40/tutorials/rheoFoam/Aneurysm/HerschelBulkley/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }

    U
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0.001;
        minIter           0;
        maxIter           1000;
    }
 
}

PostProcessing
{
  functions
   (
     WSSmag
      {
        funcType           calcWSS;
        
        isViscoelastic           false;
        includeSolventStresses   false; // Only applies for viscoelastic models
        includePolymericStresses false; // Only applies for viscoelastic models

        enabled            true;
        evaluateInterval   1;       
      }
   );
}

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}

relaxationFactors
{
     fields
      {        
        p 0.9;
      }

     equations
      { 
        U 1;
      }
}

// ************************************************************************* //
